Repository: schematics/schematics
Catalog: schemv/locale/*/LC_MESSAGES/schematics.po
Languages: de_de, pt_br

source: Couldn't interpret value as an ObjectId.
de_de: Wert konnte nicht als ObjectId interpretiert werden.
pt_br: O valor não pode ser convertido para um ObjectId.

source: This field is required.
de_de: Dies ist ein Pflichtfeld.
pt_br: O campo é obrigatório.

source: Value must be one of {0}.
de_de: Wert muss einer von {0} sein.
pt_br: O valor deve ser um dentre {0}.

source: Couldn't interpret '{0}' value as UUID.
de_de: Wert '{0}' konnte nicht als UUID interpretiert werden.
pt_br: O valor '{0}' não pode ser convertido para UUID.

source: Couldn't interpret '{0}' as string.
de_de: '{0}' konnte nicht als String interpretiert werden.
pt_br: O valor '{0}' não pode ser convertido para texto.

source: Invalid UTF-8 data.
de_de: Ungültige UTF-8-Daten.
pt_br: Dados devem ser UTF-8.

source: String value is too long.
de_de: String-Wert ist zu lang.
pt_br: Texto muito longo.

source: String value is too short.
de_de: String-Wert ist zu kurz.
pt_br: Texto muito curto.

source: String value did not match validation regex.
de_de: String-Wert stimmt nicht mit dem Validierungs-Regex überein.
pt_br: Texto não corresponde à máscara de validação.

source: Value '{0}' is not {1}.
de_de: Wert '{0}' entspricht nicht {1}.
pt_br: O valor '{0}' não é um {1}.

source: {0} value should be greater than or equal to {1}.
de_de: Wert {0} sollte größer oder gleich {1} sein.
pt_br: O valor {0} deve ser maior ou igual a {1}.

source: {0} value should be less than or equal to {1}.
de_de: Wert {0} sollte kleiner oder gleich {1} sein.
pt_br: O valor {0} deve ser menor ou igual a {1}.

source: Number '{0}' failed to convert to a decimal.
de_de: Nummer '{0}' konnte nicht zu Dezimal konvertiert werden.
pt_br: Falha ao converter o número '{0}' para decimal.

source: Value should be greater than or equal to {0}.
de_de: Wert sollte größer oder gleich {0} sein.
pt_br: O valor deve ser maior ou igual a {0}.

source: Value should be less than or equal to {0}.
de_de: Der Wert sollte kleiner oder gleich {0} sein.
pt_br: O valor deve ser menor ou igual a {0}.

source: Hash value is wrong length.
de_de: Hash-Wert hat die falsche Länge.
pt_br: Hash de comprimento incorreto.

source: Hash value is not hexadecimal.
de_de: Hash-Wert ist nicht hexadezimal.
pt_br: Hash deve ser hexadecimal.

source: Must be either true or false.
de_de: Muss entweder wahr oder falsch sein.
pt_br: O valor deve ser interpretável como verdadeiro ou falso.

source: Could not parse {0}. Should be ISO 8601 (YYYY-MM-DD).
de_de: Konnte {0} nicht parsen. Wert sollte ISO 8601 (YYYY-MM-DD) sein.
pt_br: {0} deve estar no formato ISO 8601 (YYYY-MM-DD).

source: Could not parse {0}. Valid formats: {1}
de_de: Konnte {0} nicht parsen. Valide Formate sind: {1}
pt_br: {0} deve estar em um dos formatos esperados: {1}

source: Could not parse {0}. Should be ISO 8601 or timestamp.
de_de: Konnte {0} nicht parsen. Wert sollte ISO 8601 oder ein Zeitstempel sein.
pt_br: {0} deve estar no formato ISO 8601 ou timestamp.

source: Could not parse {0}.
de_de: {0} konnte nicht geparst werden.
pt_br: {0} não é válido.

source: Could not parse {0}. Time zone offset required.
de_de: Konnte {0} nicht parsen. Zeitzonenverschiebung erforderlich.
pt_br: {0} deve conter indicação de fuso horário.

source: Could not parse {0}. Time zone offset not allowed.
de_de: Konnte {0} nicht parsen. Zeitzonenverschiebung ist nicht erlaubt.
pt_br: {0} não deve conter indicação de fuso horário.

source: Could not convert {0}. Time zone required but not found.
de_de: Konnte {0} nicht konvertieren. Zeitzone erforderlich, aber nicht gefunden .
pt_br: {0} deve conter indicação de fuso horário.

source: Could not convert {0}. Time zone offsets not allowed.
de_de: Konnte {0} nicht konvertieren. Zeitzonenverschiebungen sind nicht erlaubt.
pt_br: {0} não deve conter indicação de fuso horário.

source: Time zone information required but not found.
de_de: Zeitzoneninformationen erforderlich, aber nicht gefunden.
pt_br: A informação de fuso horário é obrigatória.

source: Time zone information not allowed.
de_de: Zeitzoneninformationen sind nicht erlaubt.
pt_br: Não deve conter informação de fuso horário.

source: Time zone must be UTC but was None.
de_de: Zeitzone muss UTC sein, ist aber None.
pt_br: O fuso horário deve ser UTC mas recebeu None.

source: Time zone must be UTC.
de_de: Zeitzone muss UTC sein.
pt_br: O fuso horário deve ser UTC.

source: {0} value {1} should be greater than or equal to {2}.
de_de: {0} Wert {1} sollte größer oder gleich {2} sein.
pt_br: {0} com valor {1}, deve ser mair ou igual a {2}.

source: {0} value {1} should be less than or equal to {2}.
de_de: {0} Wert {1} sollte kleiner oder gleich {2} sein.
pt_br: {0} com valor {1}, deve ser menor ou igual a {2}.

source: GeoPointType can only accept tuples, lists, or dicts
de_de: GeoPointType akzeptiert ausschließlich Tuples, Listen oder Dictionaries
pt_br: GeoPointType aceita apenas tuplas, listas ou dicionários.

source: Value must be a two-dimensional point
de_de: Wert muss ein zweidimensionaler Punkt sein
pt_br: O valor deve ser um ponto bidimensional.

source: Both values in point must be float or int
de_de: Beide Werte in einem Punkt müssen Float oder Integer sein
pt_br: Ambos valores do ponto devem ser inteiros ou ponto flutuante.

source: Couldn't interpret value as string.
de_de: Konnte Wert nicht als String interpretieren.
pt_br: O valor não pode ser convertido para texto.

source: String value in locale {0} is too long.
de_de: String-Wert in Sprachumgebung {0} ist zu lang.
pt_br: Texto muito longo no idioma {0}.

source: String value in locale {0} is too short.
de_de: String-Wert in Sprachumgebung {0} ist zu kurz.
pt_br: Texto muito curto no idioma {0}.

source: No requested locale was available.
de_de: Keine angeforderte Sprachumgebung verfügbar.
pt_br: Idioma não disponível.

source: No default or explicit locales were given.
de_de: Es wurden keine Standard- oder expliziten Sprachumgebungen angegeben.
pt_br: Nenhum idioma foi definido.

source: Name of locale {0} did not match validation regex.
de_de: Name der Sprachumgebung {0} stimmte nicht mit Validierungs-Regex überein.
pt_br: Nome de idioma {0} não corresponde à máscara de validação.

source: String value in locale {0} did not match validation regex.
de_de: String-Wert in Sprachumgebung {0} stimmte nicht mit dem Validierungs-Regex überein.
pt_br: Texto no idioma {0} não corresponde à máscara de validação.

source: Value must be a dict or None
de_de: Wert muss ein Dictionary oder None sein
pt_br: O valor deve ser um dicionário ou None.

source: Model conversion requires a model or dict
de_de: Modell-Konvertierung erfordert ein Modell oder Dictionary
pt_br: Conversão do Model requer uma instância do modelo ou um dicionário.

source: Input must be a mapping or '%s' instance
de_de: Eingabe muss ein Mapping oder eine '%s'-Instanz sein
pt_br: O valor deve ser um mapeamento ou uma instância de '%s'.

source: Minimum list size is greater than maximum list size.
de_de: Minimale Listengröße ist größer als die maximale Listengröße.
pt_br: O tamanho mínimo da lista é maior do que o seu tamanho máximo.

source: Could not interpret the value as a list
de_de: Konnte den Wert nicht als Liste interpretieren
pt_br: O valor não pode ser convertido para uma lista.

source: Please provide at least %d item.
de_de: Bitte mindestens %d Element angeben.
pt_br: Forneça pelo menos %d item.

source: Please provide at least %d items.
de_de: Bitte mindestens %d Elemente angeben.
pt_br: Forneça pelo menos %d itens.

source: Please provide no more than %d item.
de_de: Bitte nicht mehr als %d Element angeben.
pt_br: Forneça no máximo %d item.

source: Please provide no more than %d items.
de_de: Bitte nicht mehr als %d Elemente angeben.
pt_br: Forneça no máximo %d itens.

source: Only mappings may be used in a DictType
de_de: In einem DictType dürfen nur Mappings verwendet werden
pt_br: DictType aceita apenas mapeamentos.

source: Please use a mapping for this field or an instance of {}
de_de: Bitte ein Mapping oder eine Instanz von {} für das Feld angeben
pt_br: O valor deve ser um mapeamento ou uma instância de {}.

source: Invalid IP%s address
de_de: Ungültige IP%s Adresse
pt_br: Endereço IP%s inválido.

source: Invalid MAC address
de_de: Ungültige MAC-Adresse
pt_br: Endereço MAC inválido.

source: Not a well-formed email address.
de_de: Keine wohlgeformte E-Mail-Adresse.
pt_br: Endereço de e-mail inválido.

source: Couldn't interpret value '{0}' as any of {1}.
de_de: Konnte Wert {0} nicht als einen von {1} interpretieren.
pt_br: O valor '{0}' não pode ser convertido para nenhum dentre {1}.
